<a href="https://colab.research.google.com/github/manjulamishra/DS-Code-Pandas_Useful_Functions/blob/master/Join_Merge_Concat_in_Python.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

# Joins

In [ ]:
import pandas as pd
import numpy as np

## Self Join
https://dfrieds.com/data-analysis/self-join-python-pandas

https://stackoverflow.com/questions/41434723/self-join-with-pandas

In SQL, self join is a join when you join a table to itself. This is helpful in comparing rows to one another, base don their values in columns, in a *single* table.

### An example
basic real estate transcations

**Create a table**
table includes:
1. a unique transaction id for each purchase
2. A close date for each sale
3. the buyer's name and seller's name

Notice that Julia was a buyer for transaction id 1 and a seller for transaciton id 2

# Note
I've been palying with changing names/duplicating Julia/Lara's name. So some of the comments might not even make sense as I'll read my notebook later. I should read the comments and change the names to match the comments/resutls

In [ ]:
dates = pd.date_range('2012-08-01', periods=5)
data = pd.DataFrame({'transaction_id': [1,2,3,4,5],
                    'close_date':dates,
                    'buyer_name':['Julia', 'Joe', 'Jake', "Jamie", "Jackie"],
                    'seller_name': ['Lara', 'Barbara', 'Julia', 'Emily', 'Mason' ]})

In [ ]:
data

   transaction_id close_date buyer_name seller_name
0               1 2012-08-01      Julia        Lara
1               2 2012-08-02        Joe     Barbara
2               3 2012-08-03       Jake       Julia
3               4 2012-08-04      Jamie       Emily
4               5 2012-08-05     Jackie       Mason

## Find people who were Both Buyers and Sellers
We want to know who are the people who bought a house but also sold a house. 

One method of finding a solution is to do a self join. In pandas, the DataFrame object has a merge() method. Below, for df, for the merge() method, I'll set the following arguments:

1. right = df so that the first df listed in the statement merges with another DataFrame, df
2. left_on = 'buyer_name' is the column to join from the left df
3. right_on = 'seller_name' is the column to join from the right df

BY default, these arguments are also set in the merge() method:
*  how = 'inner' so the return results only 
show records in which the left df has a value in buyer_name equivalent to the right df with a vlaue if seller_name.
*  suffixes = ('_x', '_y') so _x is appende dto the end of the column names for our left df if those column names originally match the right df. _y is appended to the end of column names from our right df if those column names originally match the left df.



> Indented block

In [ ]:
df = data
# we are merging the same df on two different columns
#  we are saying that show the enteries which match buyers from df and sellers from df
# it shows only those results but with all columns twice adding _x/_y as suffixes
# I, on purpose, created a duplicate row for Juila and since the condition says that 
# get all the matching results, it repeats the first columns again for Julia's 
# second gig as a seller
df2 = df.merge(right=df, left_on='buyer_name', right_on='seller_name')

In [ ]:
df2

   transaction_id_x close_date_x  ... buyer_name_y seller_name_y
0                 1   2012-08-01  ...         Jake         Julia

[1 rows x 8 columns]

Our ouptput of df2 shows the details of Julia who bought a home and sold sold two homes

*  we can find all unique values in the buyer_name_x field to programmatically arrive at our result

In [ ]:
# when we do unique that means it will have only names 
# that we wanted to see repeat (the same name as buyers and sellers)
df2['buyer_name_x'].unique()

array(['Julia'], dtype=object)

## Intermediate Real Estate Transcations

### appneding new row to teh dataset
let's crete a new row to the existing dataset in which Julia buys a second home

In [ ]:
df.loc[5] = [6,'2012-08-05', 'Julia', 'Mary']

In [ ]:
df

   transaction_id           close_date buyer_name seller_name
0               1  2012-08-01 00:00:00      Julia        Lara
1               2  2012-08-02 00:00:00        Joe     Barbara
2               3  2012-08-03 00:00:00       Jake       Julia
3               4  2012-08-04 00:00:00      Jamie       Emily
4               5  2012-08-05 00:00:00     Jackie       Mason
5               6           2012-08-05      Julia        Mary

### Find people who are both buyers and sellers

In [ ]:
df3 = df.merge(right=df, left_on='buyer_name', right_on='seller_name')
df3

   transaction_id_x         close_date_x  ... buyer_name_y seller_name_y
0                 1  2012-08-01 00:00:00  ...         Jake         Julia
1                 6           2012-08-05  ...         Jake         Julia

[2 rows x 8 columns]

### Explanation
the first record indicates Juila's purchase for transcation_id of 1 and later a sale with transcation_id 3

the second record indicates Julia's purchase for transcation_id of 6 anfd later a sale with transcation_id 3

This is the correct output as i wanted all rows to of df joined with df in which a buyer_name from the left df matched to seller_name from the right df.

All unique values of the buyer_name_x field arrive at the same conclusion.

In [ ]:
df2['buyer_name_x'].unique()

array(['Julia'], dtype=object)

# Difference between join(), merge(), and concat()

https://martin-thoma.com/pandas-merge-join-concatenate/

*  merge by default uses inner join which means it takes only the common observations from both dataset into account

*

In [ ]:
dates = pd.date_range('2012-08-01', periods=10)
df = pd.DataFrame({'transaction_id': range(0,10),
                    'close_date':dates,
                    'buyer_name':['Julia', 'Jim', 'Jake', "Jill", "Jackie", "Nimita", 'Manjula', 'Ajay', 'Ojas', 'James'],
                    'seller_name': ['Jim', 'Barbara', 'Julia', 'Emily', 'Mason',"Nimmu", 'Maggi', 'Kayla', 'James', 'Ojas' ]})
df

   transaction_id close_date buyer_name seller_name
0               0 2012-08-01      Julia         Jim
1               1 2012-08-02        Jim     Barbara
2               2 2012-08-03       Jake       Julia
3               3 2012-08-04       Jill       Emily
4               4 2012-08-05     Jackie       Mason
5               5 2012-08-06     Nimita       Nimmu
6               6 2012-08-07    Manjula       Maggi
7               7 2012-08-08       Ajay       Kayla
8               8 2012-08-09       Ojas       James
9               9 2012-08-10      James        Ojas

In [ ]:
dates = pd.date_range('2012-08-01', periods=5)
df2 = pd.DataFrame({'transaction_id': [1,2,3,4,5],
                    'close_date':dates,
                    'buyer_name':['Julia', 'Joe', 'Jake', "Jamie", "Jackie"],
                    'seller_name': ['Lara', 'Barbara', 'Julia', 'Emily', 'Mason' ]})

In [ ]:
df2

   transaction_id close_date buyer_name seller_name
0               1 2012-08-01      Julia        Lara
1               2 2012-08-02        Joe     Barbara
2               3 2012-08-03       Jake       Julia
3               4 2012-08-04      Jamie       Emily
4               5 2012-08-05     Jackie       Mason

# Merge()

to perform multiple dfs merge
 
pd.merge(pd.merge(df1,df2,on='name'),df3,on='name')

## Merge Inner

### default how='inner'

if not metioned, merge automatically performs inner join

You metion which column(s) you want to merge on. You can do inner merge of multiple columns

In [ ]:
# df2.merge(df, on='close_date')
# df2.merge(df, on='close_date', how='inner') 
df2.merge(df, on=['close_date', 'buyer_name'])

   transaction_id_x close_date  ... transaction_id_y seller_name_y
0                 1 2012-08-01  ...                0           Jim
1                 3 2012-08-03  ...                2         Julia
2                 5 2012-08-05  ...                4         Mason

[3 rows x 6 columns]

## Left Merge

left merge is when all the rows and columns from the left table are kept in final table but only the matching rows from the right are joined. If the left table doesn't have the matching rows, it's replaced with NaNs

In [ ]:
#  since df has more rows than df2, when we merge df2, 
# it creates NaNs for the values not foun din df2
df.merge(df2, on='close_date', how='left')

   transaction_id_x close_date  ... buyer_name_y seller_name_y
0                 0 2012-08-01  ...        Julia          Lara
1                 1 2012-08-02  ...          Joe       Barbara
2                 2 2012-08-03  ...         Jake         Julia
3                 3 2012-08-04  ...        Jamie         Emily
4                 4 2012-08-05  ...       Jackie         Mason
5                 5 2012-08-06  ...          NaN           NaN
6                 6 2012-08-07  ...          NaN           NaN
7                 7 2012-08-08  ...          NaN           NaN
8                 8 2012-08-09  ...          NaN           NaN
9                 9 2012-08-10  ...          NaN           NaN

[10 rows x 7 columns]

## Merge Right

Right merge is just opposite to the Left Join

In [ ]:
df.merge(df2, on='buyer_name', how='right')

   transaction_id_x close_date_x  ... close_date_y seller_name_y
0               0.0   2012-08-01  ...   2012-08-01          Lara
1               2.0   2012-08-03  ...   2012-08-03         Julia
2               4.0   2012-08-05  ...   2012-08-05         Mason
3               NaN          NaT  ...   2012-08-02       Barbara
4               NaN          NaT  ...   2012-08-04         Emily

[5 rows x 7 columns]

## Outer Merge

Outer merge is when both dataframes are merged despite any commonalities. All rows and columns from both dfs are preserved in the resulting table

In [ ]:
df.merge(df2, on='close_date', how='outer')

   transaction_id_x close_date  ... buyer_name_y seller_name_y
0                 0 2012-08-01  ...        Julia          Lara
1                 1 2012-08-02  ...          Joe       Barbara
2                 2 2012-08-03  ...         Jake         Julia
3                 3 2012-08-04  ...        Jamie         Emily
4                 4 2012-08-05  ...       Jackie         Mason
5                 5 2012-08-06  ...          NaN           NaN
6                 6 2012-08-07  ...          NaN           NaN
7                 7 2012-08-08  ...          NaN           NaN
8                 8 2012-08-09  ...          NaN           NaN
9                 9 2012-08-10  ...          NaN           NaN

[10 rows x 7 columns]

## Set-Like Operations

**Rows that appear in both df, df2, inner join/intersection**

pd.merge(df1,df2)

**Rows that appear in either or both df or df2 (union) it's outer join**

pd.merge(df1,df2, how='outer')

**Rows that appear in df1 but not in df2(set difference)**

pd.merge(df1,df2, how='outer', indicator=True).query('_merge == "left_only"').drop(columns=['_merge'])

##Rows that appear in df1 but not in df2(set difference)

pd.merge(df1,df2, how='outer', indicator=True).query('_merge == "left_only"').drop(columns=['_merge'])

In [ ]:
df.merge(df2, how='outer', indicator=True).query('_merge=="left_only"').drop(columns=['_merge'])

   transaction_id close_date buyer_name seller_name
0               0 2012-08-01      Julia         Jim
1               1 2012-08-02        Jim     Barbara
2               2 2012-08-03       Jake       Julia
3               3 2012-08-04       Jill       Emily
4               4 2012-08-05     Jackie       Mason
5               5 2012-08-06     Nimita       Nimmu
6               6 2012-08-07    Manjula       Maggi
7               7 2012-08-08       Ajay       Kayla
8               8 2012-08-09       Ojas       James
9               9 2012-08-10      James        Ojas

# Joins

Join is another way to merge tables. It's used when the merging is done on the index. 

For merge, the default behavior is to merge on columns. Join merges on indexes.

Join columns with other df either on index or on a key column. 


DataFrame.join(other, on=None, how='left', lsuffix='', rsuffix='', sort=False)

In [ ]:
df

   transaction_id close_date buyer_name seller_name
0               0 2012-08-01      Julia         Jim
1               1 2012-08-02        Jim     Barbara
2               2 2012-08-03       Jake       Julia
3               3 2012-08-04       Jill       Emily
4               4 2012-08-05     Jackie       Mason
5               5 2012-08-06     Nimita       Nimmu
6               6 2012-08-07    Manjula       Maggi
7               7 2012-08-08       Ajay       Kayla
8               8 2012-08-09       Ojas       James
9               9 2012-08-10      James        Ojas

### Index-to-index if a column isn't specified

In [ ]:
# join dataframes using indexes
df.join(df2, how='outer', lsuffix='_x')

   transaction_id_x close_date_x buyer_name_x  ... close_date  buyer_name seller_name
0                 0   2012-08-01        Julia  ... 2012-08-01       Julia        Lara
1                 1   2012-08-02          Jim  ... 2012-08-02         Joe     Barbara
2                 2   2012-08-03         Jake  ... 2012-08-03        Jake       Julia
3                 3   2012-08-04         Jill  ... 2012-08-04       Jamie       Emily
4                 4   2012-08-05       Jackie  ... 2012-08-05      Jackie       Mason
5                 5   2012-08-06       Nimita  ...        NaT         NaN         NaN
6                 6   2012-08-07      Manjula  ...        NaT         NaN         NaN
7                 7   2012-08-08         Ajay  ...        NaT         NaN         NaN
8                 8   2012-08-09         Ojas  ...        NaT         NaN         NaN
9                 9   2012-08-10        James  ...        NaT         NaN         NaN

[10 rows x 8 columns]

### Joining using a column where you set a column as index

In [ ]:
#  in this case, we set a column as an index in both dfs
# and joined on that column
df.set_index('close_date').join(df2.set_index('close_date'), lsuffix='_x')

            transaction_id_x buyer_name_x  ... buyer_name  seller_name
close_date                                 ...
2012-08-01                 0        Julia  ...      Julia         Lara
2012-08-02                 1          Jim  ...        Joe      Barbara
2012-08-03                 2         Jake  ...       Jake        Julia
2012-08-04                 3         Jill  ...      Jamie        Emily
2012-08-05                 4       Jackie  ...     Jackie        Mason
2012-08-06                 5       Nimita  ...        NaN          NaN
2012-08-07                 6      Manjula  ...        NaN          NaN
2012-08-08                 7         Ajay  ...        NaN          NaN
2012-08-09                 8         Ojas  ...        NaN          NaN
2012-08-10                 9        James  ...        NaN          NaN

[10 rows x 6 columns]

### Important note

This method preserves orginal dataframes index in the resulting table

In [ ]:
# same thing done a bit differently 
df.join(df2.set_index('close_date'), on='close_date', lsuffix='_x')

   transaction_id_x close_date  ... buyer_name seller_name
0                 0 2012-08-01  ...      Julia        Lara
1                 1 2012-08-02  ...        Joe     Barbara
2                 2 2012-08-03  ...       Jake       Julia
3                 3 2012-08-04  ...      Jamie       Emily
4                 4 2012-08-05  ...     Jackie       Mason
5                 5 2012-08-06  ...        NaN         NaN
6                 6 2012-08-07  ...        NaN         NaN
7                 7 2012-08-08  ...        NaN         NaN
8                 8 2012-08-09  ...        NaN         NaN
9                 9 2012-08-10  ...        NaN         NaN

[10 rows x 7 columns]

# Concat()

## Append rows of DataFrames

Stacking horizontally (axis = 0)

In [ ]:
pd.concat([df,df2])

   transaction_id close_date buyer_name seller_name
0               0 2012-08-01      Julia         Jim
1               1 2012-08-02        Jim     Barbara
2               2 2012-08-03       Jake       Julia
3               3 2012-08-04       Jill       Emily
4               4 2012-08-05     Jackie       Mason
5               5 2012-08-06     Nimita       Nimmu
6               6 2012-08-07    Manjula       Maggi
7               7 2012-08-08       Ajay       Kayla
8               8 2012-08-09       Ojas       James
9               9 2012-08-10      James        Ojas
0               1 2012-08-01      Julia        Lara
1               2 2012-08-02        Joe     Barbara
2               3 2012-08-03       Jake       Julia
3               4 2012-08-04      Jamie       Emily
4               5 2012-08-05     Jackie       Mason

## Append columns of Dataframes

stacking vertically axis = 1

In [ ]:
pd.concat([df, df2], axis=1)

   transaction_id close_date  buyer_name  ... close_date  buyer_name seller_name
0               0 2012-08-01       Julia  ... 2012-08-01       Julia        Lara
1               1 2012-08-02         Jim  ... 2012-08-02         Joe     Barbara
2               2 2012-08-03        Jake  ... 2012-08-03        Jake       Julia
3               3 2012-08-04        Jill  ... 2012-08-04       Jamie       Emily
4               4 2012-08-05      Jackie  ... 2012-08-05      Jackie       Mason
5               5 2012-08-06      Nimita  ...        NaT         NaN         NaN
6               6 2012-08-07     Manjula  ...        NaT         NaN         NaN
7               7 2012-08-08        Ajay  ...        NaT         NaN         NaN
8               8 2012-08-09        Ojas  ...        NaT         NaN         NaN
9               9 2012-08-10       James  ...        NaT         NaN         NaN

[10 rows x 8 columns]

# Filtering joins

From my pandas cheat sheet

All rows in df that have a match in df2

In [ ]:
df[df.buyer_name.isin(df2.buyer_name)]

   transaction_id close_date buyer_name seller_name
0               0 2012-08-01      Julia         Jim
2               2 2012-08-03       Jake       Julia
4               4 2012-08-05     Jackie       Mason

All rows in df that **DO NOT** have a match in df2

In [ ]:
df[~df.buyer_name.isin(df2.buyer_name)]

   transaction_id close_date buyer_name seller_name
1               1 2012-08-02        Jim     Barbara
3               3 2012-08-04       Jill       Emily
5               5 2012-08-06     Nimita       Nimmu
6               6 2012-08-07    Manjula       Maggi
7               7 2012-08-08       Ajay       Kayla
8               8 2012-08-09       Ojas       James
9               9 2012-08-10      James        Ojas

### More filtering 


DataFrame.filter(self, items=None, like=None, regex=None, axis=None)[source]

https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.DataFrame.filter.html

In [ ]:
#let's create a small df
df = pd.DataFrame(np.array(([1,2,3], [4,5,6])),
                  index=['mouse', 'rabbit'],
                  columns=['one', 'two', 'three'])

In [ ]:
df

        one  two  three
mouse     1    2      3
rabbit    4    5      6

In [ ]:
# select column by name
# pass a list columns
df.filter(items=['one', 'two'])

        one  two
mouse     1    2
rabbit    4    5

In [ ]:
# select column by regular expression 
# df.filter(regex='o', axis=1) => this will output both columns one and two with os
df.filter(regex='o$', axis=1)

        two
mouse     2
rabbit    5

In [ ]:
# this filter the row because we indicated axis=0 and looks for indexes consists of 'bbi
df.filter(like="bbi", axis=0)

        one  two  three
rabbit    4    5      6